app/controllers/artists_controller.rb

SELECT "artists".* FROM "artists"
---
  def index
    @artists = Artist.paginate(:page => params[:page], :per_page => 2)

SELECT "artists".* FROM "artists" WHERE (title LIKE '%van gogh%') LIMIT 2 OFFSET 0
---
  def search
    @artists = Artist.paginate(:page => params[:page], :per_page => 2).search params[:q]

INSERT INTO "artists" ("created_at", "dob", "name", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", Thu, 10 Oct 2013 15:36:49 UTC +00:00], ["dob", Wed, 02 Jan 2008], ["name", "beuwick"], ["updated_at", Thu, 10 Oct 2013 15:36:49 UTC +00:00]]
---
  def create
    @artist = Artist.new(params[:artist])

    respond_to do |format|
      if @artist.save

SELECT "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "artists" SET "name" = 'De vinci', "dob" = '2003-03-02', "updated_at" = '2013-10-10 15:37:11.564397' WHERE "artists"."id" = 1
---
  def update
    @artist = Artist.find(params[:id])

    respond_to do |format|
      if @artist.update_attributes(params[:artist])