app/controllers/posts_controller.rb

  def create
    @post = Post.new(params[:post])

    respond_to do |format|
      if @post.save
---
INSERT INTO "posts" ("artwork_id", "content", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["artwork_id", 1], ["content", "Image"], ["created_at", Wed, 04 Dec 2013 17:04:04 UTC +00:00], ["updated_at", Wed, 04 Dec 2013 17:04:04 UTC +00:00], ["user_id", 2]]