app/controllers/users_controller.rb

INSERT INTO "users" ("address", "created_at", "email", "favourite", "latitude", "longitude", "name", "number", "password_digest", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
 def create
    @user = User.new(params[:user])

    respond_to do |format|
      if @user.save